// Decompiled by Jad v1.5.8e2. Copyright 2001 Pavel Kouznetsov.
// Jad home page: http://kpdus.tripod.com/jad.html
// Decompiler options: packimports(3) fieldsfirst ansi space 
// Source File Name:   ErrorMessage.java

package com.amarsoft.app.datax.ecr.common;

import com.amarsoft.are.ARE;
import com.amarsoft.are.log.Log;
import java.util.Arrays;

public class ErrorMessage
{

	private static final int errCode[] = {
		1000, 1001, 1002, 1004, 1006, 1008, 1009, 1010, 1011, 1012, 
		1013, 1014, 1015, 1016, 1017, 1018, 1019, 1020, 1021, 1022, 
		1023, 1024, 1025, 1026, 1027, 1028, 1029, 1030, 1031, 1032, 
		1033, 2002, 2004, 2006, 2008, 2010, 2014, 2016, 2018, 2020, 
		2022, 2024, 2026, 2028, 2030, 2032, 2034, 2036, 2038, 2040, 
		2042, 2044, 2046, 2048, 2050, 2053, 3002, 3006, 3009, 3010, 
		3012, 3014, 3016, 3018, 3020, 3022, 3024, 3026, 3028, 3030, 
		3032, 3034, 3036, 3038, 3040, 3042, 3044, 3046, 3048, 3050, 
		3052, 3054, 3056, 3058, 3060, 3062, 3064, 3066, 3072, 3074, 
		3076, 3078, 3080, 4002, 4004, 4006, 4008, 4010, 4012, 4014, 
		4016, 4018, 4020, 4022, 4024, 4026, 4028, 4030, 4034, 4038, 
		4040, 4043, 4044, 4046, 4048, 4050, 4052, 4054, 4058, 4060, 
		4062, 4066, 4070, 4080, 4082, 4084, 4092, 4098, 4100, 4102, 
		4106, 4108, 4116, 4118, 4120, 4122, 4124, 4142, 4148, 4154, 
		4156, 4159, 4161, 4162, 4164, 4166, 4168, 4170, 4172, 4174, 
		4175, 4176, 4178, 4180, 4182, 4183, 4184, 4186, 4188, 4190, 
		4192, 4194, 4196, 4198, 4202, 4204, 4206, 4208, 4210, 4212, 
		4214, 4216, 4217, 4218, 4220, 4222, 4224, 4226, 4228, 4230, 
		4232, 4234, 4236, 4238, 4240, 4242, 4244, 4246, 4248, 4250, 
		4252, 4254, 4256, 4258, 4260, 4264, 4266, 4268, 4270, 4272, 
		4274, 4276, 4278, 4280, 4282, 4284, 4286, 4288, 4290, 4292, 
		4294, 4296, 4298, 4300, 4302, 4308, 4324, 4326, 4338, 4344, 
		4350, 4352, 4354, 4364, 4372, 4380, 4388, 4394, 4396, 9002, 
		9000, 9004, 9005, 9006, 9008, 9010, 9012, 9014, 9016, 9018, 
		9020, 9022, 9024, 9026, 9028, 9030, 9032, 9034, 9036, 9038
	};
	private static final String errText[] = {
		"其它错误（错误代码1000）", "报文体中每条记录长度或信息段不符合接口规范规定的长度（错误代码1001）", "当报文文件为数据上报报文时，报文文件包含的所有报文中至少有一个不为空报文。(也可能为记录格式解析失败)（错误代码1002）", "一个报文文件可以包含一个报文或者多个报文。当包含多个报文时，报文之间用两个回车换行符（“﹨r﹨n”或“﹨n”）分隔。（错误代码1004）", "当报文文件名中“报文文件种类”为“11－借款人基本信息文件”时，文件由以下4个顺序排列的报文构成，依次为：借款人概况信息报文、借款人资本构成信息报文、借款人财务报表信息报文、借款人关注信息报文。即：报文头中报文类型必须为“01－04”的顺序编号。（错误代码1006）", "当报文文件名中“报文文件种类”为“12－信贷业务信息文件”时，文件由以下11个顺序排列的报文构成，依次为：贷款业务信息采集报文、保理业务信息采集报文、票据贴现业务信息采集报文、贸易融资业务信息采集报文、信用证业务信息采集报文、保函业务信息采集报文、银行承兑汇票业务信息采集报文、公开授信信息采集报文、担保业务信息采集报文、垫款业务信息采集报文、欠息信息采集报文。即：报文头中报文类型必须为“11－21”的顺序编号。（错误代码1008）", "某条信息记录删除不成功（错误代码1009）", "当报文文件名中“报文文件种类”为“14－不良信贷资产处置信息文件”时，此文件仅包含一个不良信贷资产处置信息报文，即：报文头中报文类型必须为“61”。（错误代码 1010）", "N型数据项不符合以下规定：每一位必须是0～9的数字，数字必须在ASCII码0X30——0X39范围里（错误代码1011）", "当报文文件名中“报文文件种类”为“21－贷款卡数据批量下载请求文件”时，文件仅包含一个贷款卡数据批量下载请求报文，即：报文头中报文类型必须为“41”。（错误代码1012）", 
		"当报文文件名中“报文文件种类”为“31－批量信贷业务数据删除请求文件”时，文件仅包含一个批量信贷业务数据删除请求报文，即：报文头中报文类型必须为“51”。（错误代码1013）", "与金额有关的数据项不符合以下规定：只由0～9的数字、小数点构成，小数点后的数字最多有2位，数字必须在ASCII码0X30——0X39范围里（错误代码1014）", "必填数据项为空（错误代码1015）", "格式为 “YYYYMMDD”的数据项，不是有效日期（错误代码1016）", "对于定义了数据字典的数据项，数据项未按照数据字典中的内容填写（错误代码1017）", "组织机构代码校验不通过（错误代码1018）", "开户许可证核准号校验不通过（错误代码1019）", "贷款卡编码校验不通过（错误代码1020）", "自然人身份证号码校验不通过（错误代码1021）", "自然人证件类型和证件号码未成对出现（错误代码1022）", 
		"登记注册号类型和登记注册号未成对出现（错误代码1023）", "注册资金币种和注册资金金额未成对出现，股东注册币种和出资金额未成对出现（错误代码1024）", "组织机构代码、登记注册号和机构信用代码不能同时为空（错误代码1025）", "纳税人识别号校验不通过（错误代码1026）", "机构信用代码校验不通过（错误代码1027）", "当客户类型为基本户且基本户状态不为“待审核”时,开户核准号未填写;当客户类型为信贷户时,贷款卡编码未填写（错误代码1028）", "当客户类型为基本户时，基本户状态为必填项（错误代码1029）", "自然人股东的证件类型和证件号码为必填项（错误代码1030）", "同一报数机构报送的同一机构的股东持股比例之和不能大于100%（错误代码1031）", "此条记录正在数据核对中，请核对完毕后重新报送（错误代码1032）", 
		"该条记录在系统中不存在（错误代码1033）", "信息记录与信息记录之间用一个回车换行符（“﹨r﹨n”或“﹨n”）分隔。（错误代码2002）", "一个报文包含且只包含一个报文头、报文尾。（错误代码2004）", "当报文体中信息记录数为零时，报文头后紧跟报文尾，不留空行。（错误代码2006）", "报文头与报文体之间、报文体与报文尾之间各用一个回车换行符（“﹨r﹨n”或“﹨n”）分隔。（错误代码2008）", "任何一个报文头以英文字母“A”开始，报文尾以英文字母“Z”开始。（错误代码2010）", "20050101≤“报文生成时间”≤文件名中的“数据生成日期”。（错误代码2014）", "“报文生成时间”为有效时间，格式为“YYYYMMDDHHMMSS”。（错误代码2016）", "报文头中“金融机构代码”与报文文件名中的相同，或者是其分支机构的金融机构代码，为系统中合法的金融机构代码。（错误代码2018）", "报文尾中的“信息记录数”与报文体中的信息记录条数相符。（错误代码2020）", 
		"借款人概况信息采集报文中，“信息记录类型”只能为“01－借款人概况信息记录”。（错误代码2022）", "借款人资本构成信息采集报文中，“信息记录类型”只能为“02－借款人资本构成信息记录”。（错误代码2024）", "借款人财务报表信息采集报文中，“信息记录类型”只能为“03－2002版资产负债表信息记录”、“04－2002 版利润及利润分配表信息记录”和“05－2002 版现金流量表信息记录”、“43-2007 版资产负债表信息记录”、“44－2007 版利润及利润分配表信息记录”、“45-2007 版现金流量表信息记录”、“46－事业单位资产负债表信息记录”、“47-事业单位收入支出表信息记录”。（错误代码 2026）", "借款人关注信息采集报文中，“信息记录类型”只能为“06－诉讼信息记录”和“07－大事信息记录”。（错误代码2028）", "贷款业务信息采集报文中，“信息记录类型”只能为“08－贷款业务合同信息记录”、“09－贷款业务借据信息记录”、“10－贷款业务还款信息记录”和“11－贷款业务展期信息记录”。（错误代码2030）", "保理业务信息采集报文中，“信息记录类型”只能为“12－保理业务信息记录”。（错误代码2032）", "票据贴现业务信息采集报文中，“信息记录类型”只能为“13－票据贴现业务信息记录”。（错误代码2034）", "贸易融资业务信息采集报文中，“信息记录类型”只能为“14－融资协议信息记录”、“15－融资业务信息记录”、“16－融资业务还款信息记录”、“17－融资业务展期信息记录”。（错误代码2036）", "信用证业务信息采集报文中，“信息记录类型”只能为“18－信用证业务信息记录”。（错误代码2038）", "保函业务信息采集报文中，“信息记录类型”只能为“19－保函业务信息记录”。（错误代码2040）", 
		"银行承兑汇票业务信息采集报文中，“信息记录类型”只能为“20－汇票业务信息记录”。（错误代码2042）", "公开授信信息采集报文中，“信息记录类型”只能为“21－授信业务信息记录”。（错误代码2044）", "担保信息采集报文中，“信息记录类型”只能为“22－保证合同信息记录”、“23－抵押合同信息记录”、“24－质押合同信息记录”、“32－自然人保证合同信息记录”、“33－自然人抵押合同信息记录”、“34－自然人质押合同信息记录”。（错误代码 2046）", "垫款信息采集报文中，“信息记录类型”只能为“25－垫款信息记录”。（错误代码2048）", "欠息信息采集报文中，“信息记录类型”只能为“26－欠息信息记录”。（错误代码2050）", "不良信贷资产处置信息采集报文中，“信息记录类型”只能为“51－不良信贷资产处置信息记录”。（错误代码 2053）", "信息记录第一段的段标都是“B”，即为基础段。（错误代码3002）", "进行担保信息记录报送时，若在信贷业务信息报文文件中或数据库中存在与担保合同对应的“担保标志”为“2－否”的主业务信息记录时，担保信息的“合同有效状态”必须为“2－否”。（错误代码 3006）", "对含有“展期标志”的信息记录，当数据项“展期标志”为：“1－是”，并且“信息记录操作类型”为 “1-新增 ”、“2-业务变更”或“3－修改”时，在信贷业务信息报文文件中的贷款（融资）业务信息采集报文或者数据库中必须有与上述记录相对应的展期信息记录存在。（错误代码 3009）", "对含有“展期标志”的信息记录，“信息记录操作类型”为“1-新增 ”、“2-业务变更”或“3－修改”时，如果前一次上报的对应信息记录的“展期标志”为“1－是”，则该信息记录的“展期标志”必须为：“1－是”。（错误代码3010）", 
		"对含有“展期标志”的信息记录，当数据项“展期标志”为：“2－否”时，那么在信贷业务信息报文文件中的贷款（融资）业务信息采集报文中以及数据库中不能有与上述记录相对应的展期信息记录存在。（错误代码 3012）", "对于贷款业务的合同信息、单笔借据、展期信息；融资协议信息、融资业务信息、融资业务展期信息；以及其他信贷业务信息在一天内发生的多次业务变更，必须将所有变化合并成一条信息记录上报。（错误代码3014）", "当“信息记录操作类型”不为“4－删除”时，在借款人概况信息记录中，基础段、借款人概况信息段有且只有一个。（错误代码3016）", "当“信息记录操作类型”不为“4－删除”时，在借款人资本构成信息记录中，基础段、借款人注册资本情况段有且只有一个，且至少有一个高级管理人情况段，最多包含一个集团公司信息段。（错误代码3018）", "当“信息记录操作类型”不为“4－删除”时，在资产负债表信息记录中，有且只有一个基础段和一个资产负债表段。（错误代码3020）", "当“信息记录操作类型”不为“4－删除”时，在利润及利润分配表信息记录中，有且只有一个基础段和一个利润及利润分配表段。（错误代码3022）", "当“信息记录操作类型”不为“4－删除”时，在现金流量表信息记录中，有且只有一个基础段和一个现金流量表段（错误代码3024）", "当“信息记录操作类型”不为“4－删除”时，在诉讼信息记录中，有且只有一个基础段，至少有一个诉讼信息段。（错误代码3026）", "当“信息记录操作类型”不为“4－删除”时，在大事信息记录中，有且只有一个基础段，至少有一个其他大事信息段（错误代码3028）", "当“信息记录操作类型”不为“4－删除”时，在贷款业务合同信息记录中，有且只有一个基础段和一个合同信息段，且至少有一个合同金额信息段（错误代码3030）", 
		"当“信息记录操作类型”不为“4－删除”时，在贷款业务借据信息记录中，有且只有一个基础段和一个借据信息段。（错误代码3032）", "当“信息记录操作类型”不为“4－删除”时，在贷款业务还款信息记录中，有且只有一个基础段和一个还款信息段。（错误代码3034）", "当“信息记录操作类型”不为“4－删除”时，在贷款业务展期信息记录中，有且只有一个基础段和一个展期信息段。（错误代码3036）", "当“信息记录操作类型”不为“4－删除”时，在保理业务信息记录中，有且只有一个基础段和一个保理叙做信息段。（错误代码3038）", "当“信息记录操作类型”不为“4－删除”时，在票据贴现业务信息记录中，有且只有一个基础段和一个贴现业务信息段。（错误代码3040）", "当“信息记录操作类型”不为“4－删除”时，在融资协议信息记录中，有且只有一个基础段和一个融资协议信息段。且至少有一个融资协议金额信息段。（错误代码3042）", "当“信息记录操作类型”不为“4－删除”时，在融资业务信息记录中，有且只有一个基础段和一个融资业务信息段。（错误代码3044）", "当“信息记录操作类型”不为“4－删除”时，在融资业务还款信息记录中，有且只有一个基础段和一个融资业务还款信息段（错误代码3046）", "当“信息记录操作类型”不为“4－删除”时，在融资业务展期信息记录中，有且只有一个基础段和一个展期信息段（错误代码3048）", "当“信息记录操作类型”不为“4－删除”时，在信用证业务信息记录中，有且只有一个基础段和一个信用证业务信息段（错误代码3050）", 
		"当“信息记录操作类型”不为“4－删除”时，在保函业务记录中，有且只有一个基础段和一个保函业务信息段（错误代码3052）", "当“信息记录操作类型”不为“4－删除”时，在汇票业务信息记录中，有且只有一个基础段和一个汇票业务信息段（错误代码3054）", "当“信息记录操作类型”不为“4－删除”时，在授信业务信息记录中，有且只有一个基础段和一个授信业务信息段（错误代码3056）", "当“信息记录操作类型”不为“4－删除”时，在保证合同信息记录中，有且只有一个基础段和一个保证合同信息段（错误代码3058）", "当“信息记录操作类型”不为“4－删除”时，在抵押合同信息记录中，有且只有一个基础段和一个抵押合同信息段（错误代码3060）", "当“信息记录操作类型”不为“4－删除”时，在质押合同信息记录中，有且只有一个基础段和一个质押合同信息段（错误代码3062）", "当“信息记录操作类型”不为“4－删除”时，在垫款信息记录中，有且只有一个基础段和一个垫款业务信息段（错误代码3064）", "当“信息记录操作类型”不为“4－删除”时，在欠息信息记录中，有且只有一个基础段和一个欠息信息段（错误代码3066）", "在所有业务信息报文中，基础段中标识业务的“业务号码”与标识变更段中的“业务标识号码”不能相同。（错误代码3072）", "贷款业务信息采集报文中的合同记录，如果存在多个合同金额信息段，各段中的“币种”字段必须各不相同，借款人资本构成信息采集报文中的对外投资情况记录，如果同一对外投资情况段中存在多种投资金额，则各投资金额的“币种”必须各不相同。（错误代码 3074）", 
		"贸易融资业务信息采集报文中的融资协议信息记录，如果存在多个融资协议金额信息段，各段中的“币种”字段必须各不相同。（错误代码3076）", "借款人资本构成信息采集报文中的借款人资本构成信息记录，如果存在多个借款人注册资本情况段，各段中的“币种”字段必须各不相同。（错误代码3078）", "对于属于同一贷款借据（或融资业务）且业务发生日期相同的多条信息记录，如果其中的任何一条记录出现错误，其他记录均不入库。 （错误代码 3080）", "所有数据项的数据类型必须符合《企业征信系统接口规范》中的规定。（错误代码4002）", "同一错误记录跟踪编号除填20个9的错误编号以外，其他错误跟踪编号在一个重报报文中只能出现一次。（错误代码4004）", "在报文文件名的第22位（报文文件数据类型）为“2”－重报数据时，信息记录的基础段中的“信息记录跟踪编号”为系统分配的合法的跟踪编号，并且该错误跟踪没有被纠正。（错误代码4006）", "信息记录中当“证件类型”为“身份证”时，“证件号码”必须符合身份证的编码规则。（错误代码4008）", "信息记录中的“业务发生日期”≤报文头中的“报文生成时间”，且为合法的日期。（错误代码4010）", "信息记录中所有的金融机构代码都是系统中合法的金融机构代码（包含机构状态为“正常”和“停用”），其校验位（最后 1 位）必须符合金融机构代码的校验算法。（错误代码 4012）", "注册资金、出资金额、投资金额等数据项为整数。（错误代码4014）", 
		"日期类数据项必须是 “YYYYMMDD”格式的有效日期，当不为空时，年份大于1900。（错误代码4016）", "组织机构代码必须为10位的有效组织机构代码，前8位为有效数字，第9位为“－”，第10位为校验位，算法符合GB11714－1997《全国组织机构代码编制规则》。（错误代码4018）", "“信息记录长度”的数值必须与该信息记录的实际长度相符。（错误代码4020）", "“保证金比例”必须为0－100之间的整数。（错误代码4022）", "“展期次数”≥1。（错误代码4024）", "当数据项的状态为“M”时，数据项不能为空。（错误代码4026）", "各种信息记录类型中的“证件类型”和“证件号码”要成对出现；（错误代码4028）", "各种信息记录类型中的“币种”和“金额”要成对出现。（错误代码4030）", "贷款卡编码必须是企业征信系统发放的、合法的编码；（错误代码4034）", "新上报的信息记录中“信息记录操作类型”为“4－删除”时，库中必须有相应的信息记录存在。 （错误代码4038）", 
		"当信息记录的记录操作类型为“1-新增、2-业务变更和 3-修改”其中之一时，该信息记录的业务发生日期必须大于等于库中该记录所属业务的最新信息记录的业务发生日期。 （错误代码4040）", "当贷款合同（融资协议）信息记录的记录操作类型为“4-删除”且该信息记录的业务发生日期小于等于该记录所属业务在库中的最早业务发生日期时，该合同项下必须没有借据（融资业务）记录存在（彻底删除合同前，必须先删除合同下的借据）；当存在担保的主业务信息记录的记录操作类型为“4-删除”且该信息记录的业务发生日期小于等于该记录所属业务在库中的最早业务发生日期时，主业务项下必须没有担保记录存在。(错误代码 4043)", "当信息记录的记录操作类型为“4－删除”时，该信息记录不能包含标识变更段。 （错误代码 4044）", "当信息记录的记录操作类型为“1-新增”、“2-业务变更”或“3－修改”，且包含标识变更段，则要求变更前的信息在库中存在，变更后的信息在库中不存在。 （错误代码 4046）", "如果“借款人国别”是“CHN”，那么“借款人中文名称”不能为空；（错误代码4048）", "如果“借款人国别”不是“CHN”，那么“借款人外文名称”不能为空；（错误代码4050）", "如果“借款人国别”为“CHN”是，“组织机构代码”不能为空。（错误代码4052）", "“借款人成立年份”必须是有效的年份，并且要小于或等于当前年份；（错误代码4054）", "出资资本构成情况段中，当出资方为企业时，“出资方贷款卡编码”、 “组织机构代码” 、“登记注册号”不能同时为空；当出资方为自然人时，“证件类型”、“证件号码”为必填。（（错误代码4058）", "对外投资情况段中，“被投资单位组织机构代码”与“被投资单位贷款卡编码”不能同时为空。（错误代码4060）", 
		"集团公司信息段中，“上级公司组织机构代码”与“上级公司贷款卡编码”不能同时为空。（错误代码4062）", "在借款人财务报表信息中，如果采集的是“资产负债表、利润及利润分配表”时，要求“报表类型”必须填写“11、“12”、“21、“22”、“31、“32”、“41、“42”、“51、“52”、“61、“62”、“71、“72”。如果采集的是“现金流量表”时，要求“报表类型”必须填写“10”、“20”、“30”、“40”、“50”、“60”、“70”。（错误代码 4066）", "在借款人财务报表信息中数据项“9539≥9541＋9543”。（错误代码4070）", "在借款人财务报表信息中数据项“9569≥9571”。（错误代码4080）", "在借款人财务报表信息中数据项“9573≥9575＋9577”。（错误代码4082）", "在借款人财务报表信息中数据项“9579≥9581”。（错误代码4084）", "在借款人财务报表信息中数据项“9627≥9629”。（错误代码4092）", "在借款人财务报表信息中数据项“9639=9641+9643+9645+9651+9653”。（错误代码4098）", "在借款人财务报表信息中数据项“9645≥9647＋9649”。（错误代码4100）", "在借款人财务报表信息中数据项“9657≥9659＋9661＋9663”。（错误代码4102）", 
		"在借款人2002版财务报表信息中数据项“9635＋9637＋9671＝9673”。（错误代码4106）", "在借款人2002版财务报表信息中数据项“9673＝9587”。（错误代码 4108）", "在借款人财务报表信息中数据项“9717≥9719”。（错误代码4116）", "在借款人财务报表信息中数据项“9721≥9723+9725+9727+9729”。（错误代码4118）", "在借款人财务报表信息中数据项“9909≥9731”。（错误代码4120）", "在借款人财务报表信息中数据项“9733≥9735+9737+9739+9741”。（错误代码4122）", "在借款人财务报表信息中数据项“9743≥9745”。（错误代码4124）", "在借款人2002版财务报表信息中数据项“9813＝9823－9831”。（错误代码4142）", "在借款人2002版财务报表信息中数据项“9833＝9917－9919”。（错误代码4148）", "在借款人2002版财务报表信息中数据项“9851＝9921－9923”。（错误代码4154）", 
		"在借款人2002版财务报表信息中数据项“9855＝9851＋9853＋9813＋9833”。（错误代码4156） ", "在借款人财务报表信息中数据项“9685≥9687”。（错误代码4159）", "在借款人财务报表信息中数据项“9675≥9677 + 9679”。（错误代码4161）", "表间校验：在借款人财务报表信息中数据项“9857”＝会年企利润及利润分配表中数据项“9755”的本年实际数。（错误代码4162）", "表间校验：在借款人财务报表信息中数据项“9757”的本年实际数＝会年企资产负债表中的数据项“9667”的年初数；数据项“9791”的本年实际数＝会年企资产负债表中数据项“9667”的年末数。（错误代码4164）", "“可用余额”≤“贷款合同金额”。（错误代码4166）", "“贷款合同生效日期”≤“贷款合同终止日期”。（错误代码4168）", "“展期起始日期”≤“展期到期日”。（错误代码4170）", "对于同一借据，“借据金额”－“借据余额”＝∑“借据还款金额”。（错误代码4172）", "借据“展期次数”>1时，“展期次数”＝历史“展期次数”＋1。（错误代码4174）", 
		"同一借据本次上报“还款日期” >历史最新“还款日期”。（错误代码4175）", "同一借据本次上报“还款次数” >历史最新“还款次数” （注：还款次数可以不连续）。（错误代码4176）", "“贷款合同生效日期”≤“借据放款日期”≤“借据到期日期”。即对于贷款业务借据信息记录，借据放款日期必须大于等于对应的最新的贷款业务合同信息记录的贷款合同生效日期；对于贷款业务合同信息记录，贷款合同生效日期必须小于等于对应的最新的贷款业务借据信息记录的借据放款日期。（错误代码4178）", "“借据放款日期”≤“还款日期”。即对于贷款业务还款信息记录，还款日期大于等于对应的最新贷款业务借据信息记录的放款日期。（错误代码4180）", "“贷款借据余额”≤“贷款借据金额”（错误代码4182）", "“贷款借据金额”≤“贷款合同金额”。即对于贷款业务借据信息记录，贷款借据金额必须小于等于最新的贷款业务合同信息记录对应币种的贷款合同金额；对于贷款业务合同信息记录，贷款合同金额必须大于等于该合同对应的最新贷款业务借据信息记录对应币种的借据金额； （错误代码4183）", "“展期金额”≤“借据金额”。即对于贷款业务展期信息记录，展期金额小于等于该展期信息记录对应的最新借据信息记录的借据金额；对于贷款业务借据信息记录，借据金额大于等于该借据信息记录对应的最新展期信息记录的展期金额；（错误代码4184）", "借据放款日期”≤“展期起始日期”。即对于贷款业务展期信息记录，展期起始日期大于等于该展期信息记录对应的最新贷款业务借据信息记录的借据放款日期；对于贷款业务借据信息记录，借据放款日期小于等于该借据信息记录对应的最新贷款业务展期信息记录的展期起始日期；（错误代码4186）", "对于贷款业务展期信息记录，当展期次数为1，同时该展期信息记录的对应的贷款业务借据信息记录下无还款信息记录时，展期金额等于该展期信息记录对应的最新贷款业务借据记录的借据余额；（错误代码4188）", "对于贷款业务借据信息记录,当最新的贷款业务展期信息记录的展期次数为1,且该借据信息记录没有还款信息记录时，借据余额等于对应最新贷款业务展期信息记录的展期金额；（错误代码4190）", 
		"当信息记录操作类型为“1-新增，2-业务变更，3-修改”时，对于贷款业务展期信息记录，对应的最新贷款业务借据信息记录的展期标志必须为“1-是”。（错误代码 4192）", "当信息记录操作类型为“3－修改“时，对于贷款业务合同信息记录，不能修改担保标志字段值；（错误代码4194）", "当信息记录操作类型为“3－修改“时，对于贷款业务借据信息记录，不能修改展期标志字段值；（错误代码4196）", "当信息记录操作类型为“3－修改“时，对于贷款业务合同信息记录，不能修改合同金额段的个数与币种信息； （错误代码4198）", "如果上报还款信息记录，必须同时上报借据信息记录，且还款信息记录和借据信息记录的业务发生日期一致。（错误代码4202）", "当信息记录的记录操作类型为“1-新增 ”、“2-业务变更”或“3-修改”，且展期次数为 1，则必须上报与展期信息记录业务发生日期一致的借据信息记录，或库中已存在该笔借据信息记录和相应的展期信息。（错误代码 4204）", "如果合同信息记录的信息记录操作类型为“2－业务变更”，数据库中该合同下有效的借据记录所对应的币种必须在该合同信息记录的合同金额信息中存在。（错误代码4206）", "借据信息记录、还款信息记录、展期信息记录、担保信息记录不能包含金融机构代码和合同号码的标识变更段。（错误代码4208）", "还款信息记录、展期信息记录不能包含借据编号的标识变更段。（错误代码4210）", "贷款业务借据信息记录对应的合同信息记录必须在数据库中已存在。（错误代码4212）", 
		"贷款业务还款信息记录所对应的借据信息记录必须在数据库中已存在。（错误代码4214）", "贷款业务展期信息记录所对应的借据信息记录必须在数据库中已存在。（错误代码4216）", "当“保理产品类型” 为“1-出口保理融资” 和“3-国内卖方保理融资”时,“保理业务状态”才能填“2-逾期”。（错误代码4217）", "“叙做余额”≤“叙做金额”。（错误代码4218）", "“叙做日期”≤“余额变动日期”。（错误代码4220）", "“票面金额”≥“贴现金额”。（错误代码4222）", "“承兑到期日”≥“贴现日”。（错误代码4224）", "“融资协议金额”≥“融资协议余额”。（错误代码4226）", "“融资协议生效日期”≤“融资协议终止日期”。（错误代码4228）", "“融资余额”≤“融资金额”。（错误代码4230）", 
		"“还款金额”≤“融资金额”。（错误代码4232）", "对于同一融资业务，“融资余额”＝“融资金额”－∑“融资还款金额”。（错误代码4234）", "融资业务“展期次数”>1时，融资“展期次数”＝历史“展期次数”＋1。（错误代码4236）", "同一融资业务，本次上报“还款次数” >历史最新“还款次数” （注：还款次数可以不连续）。（错误代码4238）", "“融资业务发放日期”≤“还款日期”。即对于融资业务还款信息记录，还款日期大于等于对应的最新融资业务信息记录的融资业务发放日期（错误代码4240）", "“融资业务发放日期”≤“展期起始日期”≤“展期到期日”。对于融资业务展期信息记录，展期起始日期大于等于该展期信息记录对应的最新融资业务信息记录的融资业务发放日期；对于融资业务信息记录，融资业务发放日期小于等于该融资业务信息记录对应的最新融资业务展期信息记录的展期起始日期；（错误代码4242）", "“展期金额”≤“融资金额”。即对于融资业务展期信息记录，展期金额小于等于该展期信息记录对应的最新融资业务信息记录的融资金额；对于融资业务信息记录，融资金额大于等于该融资业务信息记录对应的最新融资业务展期信息记录的展期金额；（错误代码4244）", "“融资金额”≤“融资协议金额”。对于融资业务信息记录，融资金额必须小于等于最新的融资协议信息记录对应的币种的融资协议金额；对于融资协议信息记录，融资协议金额必须大于等于该合同对应的最新融资业务信息记录对应币种的融资金额；（错误代码4246）", "“融资协议生效日期”≤“融资业务发放时间”。即对于融资业务信息记录，融资业务发放时间必须大于等于对应的最新的融资协议信息记录的融资协议生效日期；对于融资协议信息记录，融资协议生效日期必须小于等于对应的最新的融资业务信息记录的融资业务发放日期；（错误代码4248）", "对于融资业务信息记录,当数据库中最新的融资业务展期信息记录的展期次数为1,且数据库中该融资业务信息记录没有还款信息记录时，融资余额等于最新融资业务展期信息记录的展期金额；（错误代码4250）", 
		"对于融资业务展期信息记录，当展期次数为1，同时该展期信息记录的对应的融资业务信息记录下无还款信息记录时，展期金额等于该展期信息记录对应的最新融资业务信息记录的融资余额；（错误代码4252）", "当信息记录的记录操作类型为“1-新增”、“2-业务变更”或“3－修改”，对于融资业务展期信息记录，对应的融资业务信息记录的展期标志必须为“1-是”。（错误代码 4254） ", "当信息记录操作类型为“3－修改“时，对于融资协议信息记录，不能修改担保标志字段值；（错误代码4256）", "当信息记录操作类型为“3－修改“时，对于融资业务信息记录，不能修改展期标志字段值；（错误代码4258）", "当信息记录操作类型为“3－修改“时，对于融资协议信息记录，不能修改融资协议金额段的个数与币种信息；（错误代码4260）", "如果上报融资业务还款信息记录，必须同时上报融资业务信息记录，且融资还款信息记录和融资业务信息记录的业务发生日期一致。（错误代码4264）", "当融资业务展期信息记录的记录操作类型为“1-新增”、“2-业务变更”或“3－修改”，且展期次数为 1，则必须上报与展期信息记录业务发生日期一致的融资业务信息记录，或库中已存在该笔融资业务信息记录和相应的展期信息。（错误代码 4266） ", "如果融资协议信息记录的信息记录操作类型为“2－业务变更”，数据库中该融资协议下有效的融资业务信息记录所对应的币种必须在该融资协议信息记录的合同金额信息中存在。（错误代码4268）", "融资业务信息记录、融资业务还款信息记录、融资业务展期信息记录、担保信息记录不能包含金融机构代码和融资协议编号的标识变更段。（错误代码4270）", "融资业务还款信息记录、融资业务展期信息记录不能包含融资业务编号的标识变更段。（错误代码4272）", 
		"融资业务信息记录对应的融资协议信息记录必须在数据库中已存在。（错误代码4274）", "融资业务还款信息记录对应的融资业务信息记录必须在数据库中已存在。（错误代码4276）", "融资业务展期信息记录对应的融资业务信息记录必须在数据库中已存在。（错误代码4278）", "担保信息记录所对应的融资协议信息记录必须在数据库中已存在。（错误代码4280）", "“信用证状态”为“3－注销”时，“信用证注销日期”为必填项；“信用证状态”为其他状态时，以空格填报。（错误代码4282）", "“信用证有效期”≥“开证日期”。（错误代码4284）", "“信用证注销日期”≥“余额报告日期”≥“开证日期”（错误代码4286）", "“保函余额”≤“保函金额”（错误代码4288）", "“保函开立日期”≤“余额发生日期”。（错误代码4290）", "“汇票承兑日期”≤“汇票付款日期”。（错误代码4292）", 
		"“授信生效起始日期”≤“授信额度注销生效日期”≤“授信终止日期”。（错误代码4294）", "“授信额度注销生效日期”、“授信额度注销生效日期”同时为空，或者同时不为空。（错误代码4296）", "当“主合同编码”填为“QBZHT”时，“担保合同编码”是系统中存在的担保合同号码；否则，“主合同编码”是系统中存在的信贷业务合同/协议号码。（错误代码 4298）", "“垫款余额”≤“垫款金额”。（错误代码4300）", "“垫款日期”≤“余额发生日期”。（错误代码4302）", "对于定义了数据字典的数据项，数据项值必须为数据字典中的内容。（错误代码4308）", "在借款人2007版资产负债表信息中数据项“9159=9152+9158” 。（错误代码4324）", "在借款人2007版资产负债表信息中数据项“9130=9159”。（错误代码 4326） ", "在借款人2007版现金流量表信息中数据项“9208=9202-9207”。（错误代码4338）", "在借款人2007版现金流量表信息中数据项“9220=9214-9219”。（错误代码4344）", 
		"在借款人2007版现金流量表信息中数据项“9229=9224-9228”。（错误代码4350）", "在借款人2007版现金流量表信息中数据项“9231=9208+9220+9229”。（错误代码4352）", "在借款人2007版现金流量表信息中数据项“9233=9231+9232”。（错误代码4354）", "在借款人事业单位资产负债表信息中数据项“9294=9282+9293”。（错误代码4364）", "在借款人事业单位资产负债表信息中数据项“9320=9303+9311+9319”。（错误代码 4372）", "在借款人事业单位收入支出表信息中数据项“9341=9336+9338+9340”。（错误代码 4380）", "在借款人事业单位收入支出表信息中数据项“9357=9350+9353+9356” 。（错误代码 4388）", "在借款人事业单位收入支出表信息中数据项“9358=9336-9350”。（错误代码4394）", "在借款人事业单位收入支出表信息中数据项“9361=9338-9353”。（错误代码4396）", "存量上报时，展期记录、还款记录、担保记录的信息记录操作类型只能为“1-新增”（错误代码9002）", 
		"所有信息记录不能包含标识变更段（错误代码9000）", "有展期标志的业务，且展期标志为1，必须存在对应的展期记录（错误代码9004）", "有担保标志的业务，如果最新的记录的担保标志为“1”，必须存在对应的有效担保记录，如果担保标志为“2”，必须不能存在有效的对应担保记录（错误代码9005）", "对于贷款业务的合同信息、单笔借据、展期信息；融资协议信息、融资业务信息、融资业务展期信息；以及其他信贷业务信息在一天内发生的多次业务变更，必须将所有变化合并成一条信息记录上报（错误代码9006）", "对于存在多种信息记录类型的同一笔业务（如贷款业务或贸易融资业务），业务发生日期相同的情况下，如果本业务中的任何一条记录出现错误，与该笔业务相关的其他记录均不入库。（错误代码9008）", "信息记录中所有的金融机构代码都是系统中合法的金融机构代码（错误代码9010）", "贷款卡编码必须是企业征信系统发放的、合法的编码（错误代码9012）", "对于一次存量上报的所有贷款业务，同一借据的最新借据的 “借据金额”－“借据余额”＝∑“还款金额”。（错误代码9014）", "对于同一借据的展期信息，其“展期次数”不相同，并且业务发生日期大的“展期次数”要大于业务发生日期小的“展期次数”。（错误代码9016）", "对于同一借据的还款信息，其“还款次数”不相同，并且业务发生日期大的“还款次数”要大于业务发生日期小的“还款次数”（错误代码9018）", 
		"贷款业务借据信息记录对应的合同信息记录必须在数据库中已存在。（错误代码9020）", "贷款业务还款信息记录所对应的借据信息记录必须在数据库中已存在。（错误代码9022）", "贷款业务展期信息记录所对应的借据信息记录必须在数据库中已存在。（错误代码9024）", "对于一次存量上报的所有融资业务，∑“融资余额”＝∑“融资金额”－∑“融资还款金额”。（错误代码9026）", "对于同一融资业务的展期信息，其“展期次数”不相同，并且业务发生日期大的“展期次数”要大于业务发生日期小的“展期次数”。（错误代码9028）", "对于同一融资业务的还款信息，其“还款次数”不相同，并且业务发生日期大的“还款次数”要大于业务发生日期小的“还款次数”（错误代码9030）", "融资业务信息记录对应的融资协议信息记录必须在数据库中已存在。（错误代码9032）", "融资业务还款信息记录对应的融资业务信息记录必须在数据库中已存在。（错误代码9034）", "融资业务展期信息记录对应的融资业务信息记录必须在数据库中已存在。（错误代码9036）", "保证合同记录，抵押合同记录，质押合同记录的“主合同编号”是系统中存在的信贷业务合同/协议号码（错误代码9038）"
	};

	public ErrorMessage()
	{
	}

	public static String getErrorMessage(String errorCode, boolean escapeHTML, String errmsg[])
	{
		StringBuffer sb;
		int len;
		String s[];
		int i;
		if (errorCode.length() < 4)
			return errorCode;
		sb = new StringBuffer();
		len = errorCode.length();
		len -= len % 4;
		s = new String[len / 4];
		i = 0;
		  goto _L1
_L3:
		s[i / 4] = errorCode.substring(i, i + 4);
		if (i <= 0 || !s[i / 4].equals(s[i / 4 - 1]))
		{
			try
			{
				sb.append(searchText(Integer.parseInt(s[i / 4])));
				sb.append(errmsg[i / 4]);
			}
			catch (NumberFormatException e)
			{
				ARE.getLog().warn((new StringBuilder("错误代码不合法：")).append(s).toString());
			}
			sb.append("\n");
		}
		i += 4;
_L1:
		if (i < len) goto _L3; else goto _L2
_L2:
		String msg = sb.toString();
		if (escapeHTML)
		{
			msg = msg.replaceAll("<", "&lt;");
			msg = msg.replaceAll(">", "&gt;");
			msg = msg.replaceAll("\n", "<br>");
		}
		return msg;
	}

	public static String getErrorMessage(String errorCode, boolean escapeHTML)
	{
		StringBuffer sb;
		int len;
		String s[];
		int i;
		if (errorCode.length() < 4)
			return errorCode;
		sb = new StringBuffer();
		len = errorCode.length();
		len -= len % 4;
		s = new String[len / 4];
		i = 0;
		  goto _L1
_L3:
		s[i / 4] = errorCode.substring(i, i + 4);
		if (i <= 0 || !s[i / 4].equals(s[i / 4 - 1]))
		{
			try
			{
				sb.append(searchText(Integer.parseInt(s[i / 4])));
			}
			catch (NumberFormatException e)
			{
				ARE.getLog().warn((new StringBuilder("错误代码不合法：")).append(s).toString());
			}
			sb.append("\n");
		}
		i += 4;
_L1:
		if (i < len) goto _L3; else goto _L2
_L2:
		String msg = sb.toString();
		if (escapeHTML)
		{
			msg = msg.replaceAll("<", "&lt;");
			msg = msg.replaceAll(">", "&gt;");
			msg = msg.replaceAll("\n", "<br>");
		}
		return msg;
	}

	public static String getErrorMessage(int errorCode, boolean escapeHTML)
	{
		String s = searchText(errorCode);
		if (s == null)
		{
			s = String.valueOf(errorCode);
			ARE.getLog().warn((new StringBuilder("错误代码不合法：")).append(s).toString());
		}
		if (escapeHTML)
		{
			s = s.replaceAll("<", "&lt;");
			s = s.replaceAll(">", "&gt;");
			s = s.replaceAll("\n", "<br>");
		}
		return s;
	}

	private static String searchText(int realCode)
	{
		if (realCode < 1000 || realCode >= 10000)
			return null;
		int index = Arrays.binarySearch(errCode, realCode);
		if (index < 0 || index >= errText.length)
			return null;
		else
			return errText[index];
	}

}
